---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.FlatOnTop
source: html/8d175d9d-119e-410b-065b-94202c25ecb3.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.FlatOnTop Property

The abbreviation of the Flat On Top (FOT) string.

## Syntax (C#)
```csharp
public string FlatOnTop { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null